# ClearAllFlags Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ValueAtPointBase..::..ClearAllFlags Method
ValueAtPointBase Class See Also
---
Sets flags for all measurements to ValueAtPointFlags::None.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public void ClearAllFlags()
```

Visual Basic
---
```text
Public Sub ClearAllFlags
```

Visual C++
---
```text
public:
void ClearAllFlags()
```

# See Also
ValueAtPointBase Class
Autodesk.Revit.DB Namespace